//===================================================================
/* led_mycolor.ino  全部のLEDを好きな色で光らせる
*
*   IoTﾛﾎﾞｯﾄ開発教材
*   @MarA_Elec
*
*   ▼改版履歴
*     2026-09-29  新規作成  
*/
//===================================================================
#include <M5StackChan.h>
//===================================================================

// 初期設定 ==========================================================
// 起動時、1回だけ実行する
void setup() {

  M5StackChan.begin();      // StackChanの起動

  // 全部のLEDをｵﾚﾝｼﾞに光らせる（赤, 緑, 青）
  M5StackChan.showRgbColor(168, 40, 0);
}

// ﾒｲﾝﾙｰﾌﾟ ============================================================
void loop() {

}
