//===================================================================
/* led_side.ino  片側6個のLEDだけ光らせる
*
*   IoTﾛﾎﾞｯﾄ開発教材
*   @MarA_Elec
*
*   ▼改版履歴
*     2026-09-29  新規作成  
*/
//===================================================================
#include <M5StackChan.h>
//===================================================================

// 初期設定 ==========================================================
// 起動時、1回だけ実行する
void setup() {

  M5StackChan.begin();                    // StackChanの起動
  M5StackChan.showRgbColor(0, 0, 0);      // 起動時に光っているLEDを全部消灯

  //M5StackChan.setRgbColor(6, 0, 0, 168);  // 6番を光らせる

  // 0～5番（左側）のLEDを青く光らせる
  for (int i = 0; i < 6; i++) {
    M5StackChan.setRgbColor(i, 0, 0, 168);
  }
  M5StackChan.refreshRgb();           // 設定した色をLEDに反映する
}

// ﾒｲﾝﾙｰﾌﾟ ============================================================
void loop() {

}
