//===================================================================
/* disp_name.ino  自分の名前を画面の真ん中に表示する
*
*   IoTﾛﾎﾞｯﾄ開発教材
*   @MarA_Elec
*
*   ▼改版履歴
*     2026-10-13  新規作成  
*/
//=====================================================================
#include <M5StackChan.h>
//=====================================================================

// 初期設定 ============================================================
// 起動時、1回だけ実行する
void setup() {

  M5StackChan.begin();
  M5StackChan.showRgbColor(0, 0, 0);                // 起動時に光っているLEDを全部消灯
  M5.Display.fillScreen(BLACK);                     // 画面を黒で塗りつぶす
  
  //-------------------------------------------------------------------
  M5.Display.setTextColor(CYAN, PURPLE);            // 文字の色, 背景の色
  M5.Display.setFont(&fonts::lgfxJapanGothic_40);   // 日本語のｺﾞｼｯｸ体（40ﾄﾞｯﾄ）
  M5.Display.setTextSize(1.5);                      // 1.5倍 → 1文字60ﾄﾞｯﾄ

  // 1行目の上端 Y = (240 - 120) ÷ 2 = 60
  // 2行目の上端 Y = 60 + 60 = 120
  M5.Display.drawCenterString("すたっく", 160, 60);
  M5.Display.drawCenterString(" ちゃん ", 160, 120);
  //------------------------------------------------------------------
}

// ﾒｲﾝﾙｰﾌﾟ ============================================================
void loop() {

}
