//===================================================================
/* disp_photo.ino  microSDｶｰﾄﾞの写真（JPG）を表示する
*
*   IoTﾛﾎﾞｯﾄ開発教材
*   @MarA_Elec
*
*   ▼改版履歴
*     2026-10-19  新規作成  
*/
//===================================================================
#include <SD.h>                                     // microSDｶｰﾄﾞを使うためのﾗｲﾌﾞﾗﾘ（M5StackChan.hより先に書く）
#include <M5StackChan.h>
//===================================================================

// 初期設定 ============================================================
// 起動時、1回だけ実行する
void setup() {

  M5StackChan.begin();
  M5StackChan.showRgbColor(0, 0, 0);                // 起動時に光っているLEDを全部消灯
  M5.Display.fillScreen(BLACK);                     // 画面を黒で塗りつぶす

  SD.begin(GPIO_NUM_4, SPI, 25000000);              // microSDｶｰﾄﾞを使えるようにする（CS:GPIO4）

  M5.Display.drawJpgFile(SD, "/photo.jpg", 0, 0);   // microSDのJPGを左上(0,0)から表示
}

// ﾒｲﾝﾙｰﾌﾟ ============================================================
void loop() {

}
