//===================================================================
/* led_delay.ino  Delayを使ったLED点滅
*
*   IoTﾛﾎﾞｯﾄ開発教材
*   @MarA_Elec
*
*   ▼改版履歴
*     2026-09-10  新規作成  
*/
//===================================================================
#include <M5StackChan.h>
//===================================================================

// 関数 =============================================================

// LED点灯/消灯 --------------------------
void ledWrite(bool on) {

  if (on) {
    M5StackChan.setRgbColor(0, 168, 0, 0);   // 1個目を赤点灯
  } 
  else {
    M5StackChan.setRgbColor(0, 0, 0, 0);     // 1個目を消灯
  }
  M5StackChan.refreshRgb();
}

// 初期設定 ==========================================================
// 起動時、1回だけ実行する
void setup() {

  M5StackChan.begin();

  // 起動時に光っているLEDを全部消灯
  for (int i = 0; i < 12; i++) {
    M5StackChan.setRgbColor(i, 0, 0, 0);
  }
  M5StackChan.refreshRgb();
}

// ﾒｲﾝﾙｰﾌﾟ ============================================================
void loop() {

  ledWrite(HIGH);   // LED点灯
  delay(1000);      // 1秒待ち
  ledWrite(LOW);    // LED消灯
  delay(1000);      // 1秒待ち
}
