//===================================================================
/* disp_japanese.ino  画面に日本語を表示する
*
*   IoTﾛﾎﾞｯﾄ開発教材
*   @MarA_Elec
*
*   ▼改版履歴
*     2026-10-12  新規作成  
*/
//===================================================================
#include <M5StackChan.h>
//===================================================================

// 初期設定 ==========================================================
// 起動時、1回だけ実行する
void setup() {

  M5StackChan.begin();
  M5StackChan.showRgbColor(0, 0, 0);                  // 起動時に光っているLEDを全部消灯

  M5.Display.fillScreen(BLACK);                       // 画面を黒で塗りつぶす
  M5.Display.setTextColor(WHITE);                     // 文字の色

  // 日本語用のﾌｫﾝﾄを指定しないと、日本語は正しく表示されない
  M5.Display.drawString("こんにちは", 40, 40);         // ﾌｫﾝﾄ指定なし

  M5.Display.setFont(&fonts::lgfxJapanGothic_24);     // 日本語のｺﾞｼｯｸ体（24ﾄﾞｯﾄ）
  M5.Display.drawString("こんにちは", 40, 120);        // ﾌｫﾝﾄ指定あり
}

// ﾒｲﾝﾙｰﾌﾟ ============================================================
void loop() {

}




