//===================================================================
/* led_counter.ino  ｶｳﾝﾀを使ったLED点滅
*
*   IoTﾛﾎﾞｯﾄ開発教材
*   @MarA_Elec
*
*   ▼改版履歴
*     2026-09-10  新規作成  
*/
//===================================================================
#include <M5StackChan.h>
//===================================================================

int count = 0;         // ﾙｰﾌﾟを回った回数をｶｳﾝﾄする
bool ledOn = false;    // LEDが点灯しているかどうかを識別する

// 関数 =============================================================

// LED点灯/消灯 --------------------------
void ledWrite(bool on) {

  if (on) {
    M5StackChan.setRgbColor(0, 168, 0, 0);   // 1個目を赤点灯
  } 
  else {
    M5StackChan.setRgbColor(0, 0, 0, 0);     // 1個目を消灯
  }
  M5StackChan.refreshRgb();
}

// 初期設定 ==========================================================
// 起動時、1回だけ実行する
void setup() {

  M5StackChan.begin();

  // 起動時に光っているLEDを全部消灯
  for (int i = 0; i < 12; i++) {
    M5StackChan.setRgbColor(i, 0, 0, 0);
  }
  M5StackChan.refreshRgb();
}

// ﾒｲﾝﾙｰﾌﾟ ============================================================
void loop() {

  count = count + 1;              // 1周まわったのでｶｳﾝﾀを＋1する

  // ｶｳﾝﾄ数に達したか？
  if (count >= 4000000) {
    count = 0;                    // ｶｳﾝﾄ数をｸﾘｱ
    ledOn = !ledOn;               // 点灯と消灯を入れかえる
    ledWrite(ledOn);              // LEDに反映する
  }
}
